class 孤海_kontext生图比例:
    def __init__(self):
        pass

    @classmethod
    def INPUT_TYPES(cls):
        size_options = {
            "原始比例": (0, 0),
            "1：1（1024x1024）": (1024, 1024),
            "1：2（720x1456）": (720, 1456),
            "2：3（832x1248）": (832, 1248),
            "3：4（880x1184）": (880, 1184),
            "3：5（800x1328）": (800, 1328),
            "9：16（752x1392）": (752, 1392),
            "9：21（672x1568）": (672, 1568),
            "2：1（1456x720）": (1456, 720),
            "3：2（1248x832）": (1248, 832),
            "4：3（1184x880）": (1184, 880),
            "5：3（1328x800）": (1328, 800),
            "16：9（1392x752）": (1392, 752),
            "21：9（1568x672）": (1568, 672)
        }
        
        return {
            "required": {
                "宽度": ("INT", {
                    "default": 1024, 
                    "min": 10,
                    "max": 10240,
                    "step": 1
                }),
                "高度": ("INT", {
                    "default": 1024, 
                    "min": 10,
                    "max": 10240,
                    "step": 1
                }),
                "选择尺寸": (list(size_options.keys()), {"default": "1：1（1024x1024）"}),
            },
        }
    
    RETURN_TYPES = ("INT", "INT")
    RETURN_NAMES = ("宽度", "高度")
    FUNCTION = "calculate_size"
    CATEGORY = "孤海工具箱"

    def calculate_size(self, 宽度, 高度, 选择尺寸):
        size_map = {
            "原始比例": (宽度, 高度),
            "1：1（1024x1024）": (1024, 1024),
            "1：2（720x1456）": (720, 1456),
            "2：3（832x1248）": (832, 1248),
            "3：4（880x1184）": (880, 1184),
            "3：5（800x1328）": (800, 1328),
            "9：16（752x1392）": (752, 1392),
            "9：21（672x1568）": (672, 1568),
            "2：1（1456x720）": (1456, 720),
            "3：2（1248x832）": (1248, 832),
            "4：3（1184x880）": (1184, 880),
            "5：3（1328x800）": (1328, 800),
            "16：9（1392x752）": (1392, 752),
            "21：9（1568x672）": (1568, 672)
        }
        
        # 获取选择的尺寸
        return size_map[选择尺寸]

# 节点注册
NODE_CLASS_MAPPINGS = {
    "孤海_kontext生图比例": 孤海_kontext生图比例
}

NODE_DISPLAY_NAME_MAPPINGS = {
    "孤海_kontext生图比例": "孤海-kontext生图比例"
}